NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_umac.svd
        <register>
          <name>TXPOWER</name>
          <description>Output power</description>
          <addressOffset>0x710</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000E</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>RADIO output power</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MaxdBm</name>
                  <description>+10 dBm</description>
                  <value>0x01F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos10dBm</name>
                  <description>+10 dBm</description>
                  <value>0x01F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos9dBm</name>
                  <description>+9 dBm</description>
                  <value>0x01D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos8dBm</name>
                  <description>+8 dBm</description>
                  <value>0x01C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos7dBm</name>
                  <description>+7 dBm</description>
                  <value>0x01B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos6dBm</name>
                  <description>+6 dBm</description>
                  <value>0x01A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos5dBm</name>
                  <description>+5 dBm</description>
                  <value>0x019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4 dBm</description>
                  <value>0x018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos3dBm</name>
                  <description>+3 dBm</description>
                  <value>0x017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos2dBm</name>
                  <description>+2 dBm</description>
                  <value>0x016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos1dBm</name>
                  <description>+1 dBm</description>
                  <value>0x00F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0 dBm</description>
                  <value>0x00E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg1dBm</name>
                  <description>-1 dBm</description>
                  <value>0x00D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg2dBm</name>
                  <description>-2 dBm</description>
                  <value>0x00C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4 dBm</description>
                  <value>0x00B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8 dBm</description>
                  <value>0x00A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12 dBm</description>
                  <value>0x009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16 dBm</description>
                  <value>0x008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20 dBm</description>
                  <value>0x003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg30dBm</name>
                  <description>-30 dBm</description>
                  <value>0x002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg40dBm</name>
                  <description>-40 dBm</description>
                  <value>0x001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg70dBm</name>
                  <description>-70 dBm</description>
                  <value>0x000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MindBm</name>
                  <description>-70 dBm</description>
                  <value>0x000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x714</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of the first bit of the subsequent packet.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x718</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000007F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample result. The value of this register is read as a positive value while the actual received signal strength is a negative value. Actual received signal strength is therefore as follows: received signal strength = -A dBm.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXGAIN</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RXGAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7D0</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Override configuration of receiver gain control loop</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x001230C3</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCAAFOVERRIDE</name>
                <description>Override value for AAF</description>
                <lsb>17</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>AGCMIXOVERRIDE</name>
                <description>Override value for MIX</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>AGCLNAOVERRIDE</name>
                <description>Override value for LNA</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>AGCOVERRIDEGAIN</name>
                <description>Enable AGC override</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverride</name>
                    <description>AGC takes control over all gains</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Override</name>
                    <description>Manual control of AAF, MIX, and LNA gain settings</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FREQFINETUNE</name>
          <description>Fine tuning of the RF frequency</description>
          <addressOffset>0x0804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQFINETUNE</name>
              <description>Twos-complement number for fine-tuning the frequency. The step size is 488.28125 Hz, giving a range from -1 MHz to (one step short of) +1 MHz.</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FECONFIG</name>
          <description>Config register</description>
          <addressOffset>0x908</addressOffset>
          <access>read-write</access>
          <resetValue>0x10800005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCALERMODE</name>
              <description>Mode for narrow scaling output.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Classic log based scaling mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>LUT based scaling mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_STAT</name>
          <description>Carrier freq. offset estimate</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYNCOK</name>
              <description>SYNC ok</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SyncNotOK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SyncOk</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCCORR</name>
          <description>Correlator thresholds</description>
          <addressOffset>0xB40</addressOffset>
          <access>read-write</access>
          <resetValue>0x1FFFFF90</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TH</name>
              <description>Correlation threshold</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFEMODE</name>
          <description>Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD)</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DFEOPMODE</name>
              <description>Direction finding operation mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Direction finding mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoD</name>
                  <description>Direction finding mode set to AoD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoA</name>
                  <description>Direction finding mode set to AoA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFESTATUS</name>
          <description>DFE status information</description>
          <addressOffset>0xD04</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWITCHINGSTATE</name>
              <description>Internal state of switching state machine</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Switching state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offset</name>
                  <description>Switching state Offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Guard</name>
                  <description>Switching state Guard</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref</name>
                  <description>Switching state Ref</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Switching</name>
                  <description>Switching state Switching</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ending</name>
                  <description>Switching state Ending</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLINGSTATE</name>
              <description>Internal state of sampling state machine</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Sampling state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sampling</name>
                  <description>Sampling state Sampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL1</name>
          <description>Various configuration for Direction finding</description>
          <addressOffset>0xD10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00023282</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NUMBEROF8US</name>
              <description>Length of the AoA/AoD procedure in number of 8 us units</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DFEINEXTENSION</name>
              <description>Add CTE extension and do antenna switching/sampling in this extension</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>AoA/AoD procedure triggered at end of CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Payload</name>
                  <description>Antenna switching/sampling is done in the packet payload</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSWITCHSPACING</name>
              <description>Interval between every time the antenna is changed in the SWITCHING state</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACINGREF</name>
              <description>Interval between samples in the REFERENCE period</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLETYPE</name>
              <description>Whether to sample I/Q or magnitude/phase</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IQ</name>
                  <description>Complex samples in I and Q</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MagPhase</name>
                  <description>Complex samples as magnitude and phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACING</name>
              <description>Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPEATPATTERN</name>
              <description>Repeat every antenna pattern N times.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRepeat</name>
                  <description>Do not repeat (1 time in total)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCBACKOFFGAIN</name>
              <description>Gain will be lowered by the specified number of gain steps at the start of CTE</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL2</name>
          <description>Start offset for Direction finding</description>
          <addressOffset>0xD14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSWITCHOFFSET</name>
              <description>Signed value offset after the end of the CRC before starting switching in number of 16M cycles</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TSAMPLEOFFSET</name>
              <description>Signed value offset before starting sampling in number of 16M cycles relative to the beginning of the REFERENCE state - 12 us after switching start</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCHPATTERN</name>
          <description>GPIO patterns to be used for each antenna</description>
          <addressOffset>0xD28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWITCHPATTERN</name>
              <description>Fill array of GPIO patterns for antenna control</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
