NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_umac.svd
        <register>
          <name>RXADDRESSES</name>
          <description>Receive address select</description>
          <addressOffset>0xE40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>Enable or disable reception on logical address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR1</name>
              <description>Enable or disable reception on logical address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR2</name>
              <description>Enable or disable reception on logical address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR3</name>
              <description>Enable or disable reception on logical address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR4</name>
              <description>Enable or disable reception on logical address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR5</name>
              <description>Enable or disable reception on logical address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR6</name>
              <description>Enable or disable reception on logical address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR7</name>
              <description>Enable or disable reception on logical address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCNF</name>
          <description>CRC configuration</description>
          <addressOffset>0xE44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LEN</name>
              <description>CRC length in number of bytes.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC length is zero and CRC calculation is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>One</name>
                  <description>CRC length is one byte and CRC calculation is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>CRC length is two bytes and CRC calculation is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Three</name>
                  <description>CRC length is three bytes and CRC calculation is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPADDR</name>
              <description>Control whether CRC calculation skips the address field. Other fields can also be skipped.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>CRC calculation includes address field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Skip</name>
                  <description>CRC calculation starting at first byte after address field.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154</name>
                  <description>CRC calculation starting at first byte after length field  (as per 802.15.4 standard).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SkipS0</name>
                  <description>CRC calculation starting at first byte after S0 field.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SkipS1</name>
                  <description>CRC calculation starting at first byte after S1 field.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial</description>
          <addressOffset>0xE48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0xE4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>CRC initial value</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAB[%s]</name>
          <description>Description collection: Device address base segment n</description>
          <addressOffset>0xE50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAB</name>
              <description>Device address base segment n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DAP[%s]</name>
          <description>Description collection: Device address prefix n</description>
          <addressOffset>0xE70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAP</name>
              <description>Device address prefix n</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DACNF</name>
          <description>Device address match configuration</description>
          <addressOffset>0xE90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable or disable device address matching using device address 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable or disable device address matching using device address 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable or disable device address matching using device address 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable or disable device address matching using device address 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA4</name>
              <description>Enable or disable device address matching using device address 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA5</name>
              <description>Enable or disable device address matching using device address 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA6</name>
              <description>Enable or disable device address matching using device address 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA7</name>
              <description>Enable or disable device address matching using device address 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADD0</name>
              <description>TxAdd for device address 0</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TXADD1</name>
              <description>TxAdd for device address 1</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TXADD2</name>
              <description>TxAdd for device address 2</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>TXADD3</name>
              <description>TxAdd for device address 3</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>TXADD4</name>
              <description>TxAdd for device address 4</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TXADD5</name>
              <description>TxAdd for device address 5</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TXADD6</name>
              <description>TxAdd for device address 6</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>TXADD7</name>
              <description>TxAdd for device address 7</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BCC</name>
          <description>Bit counter compare</description>
          <addressOffset>0xE94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCC</name>
              <description>Bit counter compare</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTESTATUS</name>
          <description>CTEInfo parsed from received packet</description>
          <addressOffset>0xEA4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTETIME</name>
              <description>CTETime parsed from packet</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>RFU</name>
              <description>RFU parsed from packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTETYPE</name>
              <description>CTEType parsed from packet</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHCONF</name>
          <description>Search pattern configuration</description>
          <addressOffset>0xEB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MHRMATCHCONF</name>
              <description>Search pattern configuration</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHMASK</name>
          <description>Pattern mask</description>
          <addressOffset>0xEB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MHRMATCHMASK</name>
              <description>Pattern mask</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SFD</name>
          <description>IEEE 802.15.4 start of frame delimiter</description>
          <addressOffset>0xEBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000A7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SFD</name>
              <description>IEEE 802.15.4 start of frame delimiter. Note: the least significant 4 bits of the SFD cannot all be zeros.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
